using System;

namespace NumberToText
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.Write("Введите число: ");
            int value = Convert.ToInt32(Console.ReadLine());

            string[,] arrOfDigits = new string[,] {
                { "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять" },
                { "десять", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто" },
                { "сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот" },
                { "одна тысяча", "две тысячи", "три тысячи", "четыре тысячи", "пять тысяч", "шесть тысяч", "семь тысяч", "восемь тысяч", "девять тысяч" },
                { "десять тысяч", "двадцать тысяч", "тридцать тысяч", "сорок тысяч", "пятьдесят тысяч", "шестьдесят тысяч", "семьдесят тысяч", "восемьдесят тысяч", "девяносто тысяч" },
                { "сто тысяч", "двести тысяч", "триста тысяч", "четыреста тысяч", "пятьсот тысяч", "шестьсот тысяч", "семьсот тысяч", "восемьсот тысяч", "девятьсот тысяч" },
                { "один миллион", "", "", "", "", "", "", "", "" }
            };

            string[] arrFrom10to19 = new string[] { "десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать" };

            string textInfoCycle = "";
            bool smallArr = false;

            for (int j = 6, p = 1000000; j >= 0; j--, p /= 10)
            {
                int digit = value / p;

                if (digit > 0 || smallArr)
                {
                    if (j == 1 && digit == 1)
                    {
                        smallArr = true;
                    }
                    else
                    {
                        if (smallArr)
                        {
                            textInfoCycle = arrFrom10to19[digit];
                            smallArr = false;
                        }
                        else
                        {
                            textInfoCycle += arrOfDigits[j, digit - 1] + " ";
                        }
                    }

                    digit *= p;
                    value -= digit;
                }
            }

            Console.WriteLine($"Вы ввели: {textInfoCycle}");
        }
    }
}


